иб/src/Documents/СоставлениеПитания/СоставлениеПитания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СоставлениеПитания</name>
  <attributes>
    <name>Кормосмесь</name>
    <type>
      <types>CatalogRef.Удобрения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корма</name>
    <attributes>
      <name>Корм</name>
      <type>
        <types>CatalogRef.Удобрения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

иб/src/Documents/СоставлениеПитания/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Первоначальное заполнение нового объекта
	если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ОбщегоНазначенияСервер.ПервоначальноеЗаполнениеДокумента(ДокОбъект);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КормаКормПриИзменении(Элемент)
	
	ТекДан = Элементы.Корма.ТекущиеДанные;
	если ЗначениеЗаполнено(ТекДан.Корм) тогда
		Данные = ПолучитьДанныеПоМатериалу (ТекДан.Корм, ТекДан.Количество);
		ТекДан.ЕдиницаИзмерения = Данные.ЕдИзм;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоМатериалу (Материал, Количество)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Справочник.ЕдиницаХраненияОстатков КАК ЕдИзм,
				   |	Справочник.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	Справочник." + ?(ТипЗнч(Материал) = Тип ("СправочникСсылка.сжсвКорма"), "сжсвКорма", "сжсвВетеринарныеПрепараты") + 
				   " КАК Справочник
	               |ГДЕ
	               |	Справочник.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Материал);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ЕдИзм", Выборка.ЕдИзм);
	
	Возврат (Результат);
	
КонецФункции

#КонецОбласти
